# IFC_DMDeletePSetFld

## Description
Deletes specified IfcEntry's PSet Field.

```pascal
FUNCTION IFC_DMDeletePSetFld(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING;
				strFieldName  : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMDeletePSetFld(strObjectName, strEntryName, strPSetName, strFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|strEntryName|STRING||
|strPSetName|STRING||
|strFieldName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* IFC